class SmileyDict {
	
	constructor()
	{
	}
	
	static SMILE_CODES = [
		["[OK]", /\[OK\]/, "1f197"],
		["[爱心]", /\[爱心\]/, "1f49b"],
		["[拜托]", /\[拜托\]/, "1f64f"],
		["[棒棒的]", /\[棒棒的\]/, "1f44d"],
		["[呲牙]", /\[呲牙\]/, "1f601"],
		["[大哭]", /\[大哭\]/, "1f62d"],
		["[发呆]", /\[发呆\]/, "1f610"],
		["[发怒]", /\[发怒\]/, "1f621"],
		["[飞吻]", /\[飞吻\]/, "1f618"],
		["[尴尬]", /\[尴尬\]/, "1f62c"],
		["[惊恐]", /\[惊恐\]/, "1f616"],
		["[惊讶]", /\[惊讶\]/, "1f631"],
		["[开心]", /\[开心\]/, "1f606"],
		["[苦恼]", /\[苦恼\]/, "1f629"],
		["[酷酷的]", /\[酷酷的\]/, "1f60e"],
		["[困]", /\[困\]/, "1f611"],
		["[冷汗]", /\[冷汗\]/, "1f613"],
		["[流汗]", /\[流汗\]/, "1f605"],
		["[满意]", /\[满意\]/, "1f60c"],
		["[迷恋]", /\[迷恋\]/, "1f60d"],
		["[勉强]", /\[勉强\]/, "1f623"],
		["[喵惊讶]", /\[喵惊讶\]/, "1f640"],
		["[喵开心]", /\[喵开心\]/, "1f63a"],
		["[喵哭]", /\[喵哭\]/, "1f63f"],
		["[喵苦笑]", /\[喵苦笑\]/, "1f639"],
		["[喵色]", /\[喵色\]/, "1f63b"],
		["[哦]", /\[哦\]/, "1f60f"],
		["[伤心]", /\[伤心\]/, "1f622"],
		["[挑逗]", /\[挑逗\]/, "1f609"],
		["[调皮]", /\[调皮\]/, "1f61d"],
		["[笑哭]", /\[笑哭\]/, "1f602"],
		["[笑脸]", /\[笑脸\]/, "1f60a"],
		["[斜眼]", /\[斜眼\]/, "1f612"],
		["[祝贺]", /\[祝贺\]/, "3297"],
		[],
		[]
	];
	
	//static reg = /\[.*?\]/g;
	
	static reg =  /((<h1>|<h2>|<h3>|<h4>|<h5>|<h6>)?\[(.*?)\](<\/h1>|<\/h2>|<\/h3>|<\/h4>|<\/h5>|<\/h5>)?)/g;
	
	static hasSmile(str)
	{
		let reg = /\[.*?\]/g;
		return reg.test(str);
	}
	
	static getSmileItem(text)
	{
		let smiles = SmileyDict.SMILE_CODES;
		
		return smiles.filter(smile => {
				if(smile.length <= 0)
					return false;
				
				return smile[1].test(text)
			}
		);
	}
}

export default SmileyDict;